# Find apps here:
# https://formulae.brew.sh/formula/

# Guide:
# https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
# https://github.com/caskroom/homebrew-cask
# http://blog.eventfarm.com/developers/fresh-mac-now-what-brew-install-everything

# Install
# $ /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# $ brew install mas
# $ mas signin email@email.com
# $ brew bundle install

# Install a single cask
# brew install app-name

# Uninstall a single cask
# brew uninstall app-name

tap 'caskroom/cask'

brew 'git'
brew 'npm'

cask '1password'
cask 'adobe-creative-cloud'
cask 'adobe-photoshop-lightroom'
cask 'cyberduck'
cask 'dropbox'
cask 'firefox'
cask 'firefox-nightly'
cask 'github'
cask 'google-chrome'
cask 'google-nik-collection'
cask 'iterm2'
cask 'jotta'
cask 'local'
cask 'microsoft-edge'
cask 'node'
cask 'postman'
cask 'private-internet-access'
cask 'sourcetree'
cask 'spectacle'
cask 'vlc'
cask 'visual-studio-code'
